oldvers/STM32F103C8_BluePill/tests/test_template.c
#include "stm32f1xx.h"
#include "types.h"
#include "gpio.h"
#include "debug.h"
#include "uniquedevid.h"

#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"

#include "usb_device.h"

#include "fifo.h"

//-----------------------------------------------------------------------------

void vLEDTask(void * pvParameters)
{
    LOG("LED Task Started\r\n");
  
    while(TRUE)
    {
        LOG("LED Hi\r\n");
        vTaskDelay(50);
        LOG("LED Lo\r\n");
        vTaskDelay(50);
    }
    //vTaskDelete(NULL);
}

//-----------------------------------------------------------------------------

void vTemplateTask(void * pvParameters)
{
    LOG("Template Task Started\r\n");
  
    vTaskDelay(200);
    
    while(TRUE)
    {
        LOG("Template Task Iteration\r\n");
        vTaskDelay(500);
    }
    //vTaskDelete(NULL);
}

//-----------------------------------------------------------------------------

void Prepare_And_Run_Test( void )
{
    LOG("Preparing Template Test To Run...\r\n");

    xTaskCreate
    (
        vLEDTask,
        "LED",
        configMINIMAL_STACK_SIZE,
        NULL,
        tskIDLE_PRIORITY + 1,
        NULL
    );
    
    xTaskCreate
    (
        vTemplateTask,
        "Template",
        configMINIMAL_STACK_SIZE,
        NULL,
        tskIDLE_PRIORITY + 1,
        NULL
    );
}

//-----------------------------------------------------------------------------
